content-org/zzamboni.org
#+hugo_base_dir: ../
#+seq_todo: TODO DRAFT DONE
#+options: creator:t
#+property: header-args :eval never-export
#+hugo_front_matter_key_replace: description>summary

#+macro: updatetime {{{time(%B %e\, %Y)}}}

# The zz/* functions used in the macros are defined in my Emacs configuration:
# https://github.com/zzamboni/dot-emacs/blob/master/init.org
#+macro: hsapi (eval (zz/org-macro-hsapi-code $1 $2 $3))
#+macro: keys (eval (zz/org-macro-keys-code $1))
#+macro: luadoc (eval (zz/org-macro-luadoc-code $1 $2 $3))
#+macro: luafun (eval (zz/org-macro-luafun-code $1 $2))
#+macro: spoon [[http://www.hammerspoon.org/Spoons/$1][$1]]

#+title: zzamboni.org source file
#+author: Diego Zamboni
#+email: diego@zzamboni.org

This file is the source for all new and updated content on [[http://zzamboni.org/][my website]] since March 2018. Content here may be in progress or incomplete. This file gets converted to [[http://gohugo.io/][Hugo]] files by the excellent [[https://ox-hugo.scripter.co/][ox-hugo]].

*You really should not read it here but at [[http://zzamboni.org/][zzamboni.org]]*.

*** DONE Just Enough Lua to Be Productive in Hammerspoon, Part 2        :lua:
CLOSED: [2017-11-01 Wed 08:16]
:PROPERTIES:
:export_hugo_bundle: 2017-10-21-just-enough-lua-to-be-productive-in-hammerspoon-part2
:export_file_name: index
:export_hugo_custom_front_matter: :toc true :featured_image /images/lua-logo.svg
:END:
#+begin_description
In this second article of the "Just Enough Lua" series, we dive into Lua's types and data structures.
#+end_description

In this second article of the "Just Enough Lua" series, we dive into Lua's types and data structures.

{{% tip %}}
If you haven't already, be sure to read [[file:/post/just-enough-lua-to-be-productive-in-hammerspoon-part-1/][the first installment of this series]] to learn about the basic Lua concepts.
{{% /tip %}}

**** Tables
:PROPERTIES:
:CUSTOM_ID: tables
:END:

Table are the only compound data type in Lua, and are used to implement arrays, associative arrays (commonly called "maps" or "hashes" in other languages), modules, objects and namespaces. As you can see, it is very important to understand them!

A table in Lua is a collection of values, which can be indexed either by numbers or by arbitrary strings (the two types of indices can coexist within the same table). Let's go through a few examples that will give you an overview (you can type these in the Hammerspoon console as we go, or at the prompt of the =hs= command - keep in mind that some of the statements are broken across multiple lines here for formatting, but each statement should be type in a single line in the console).

Table literals are declared using curly braces:

#+begin_src lua
  > unicorns = {}  -- empty table
  > people = { "Chris", "Aaron", "Diego" }  -- array
  > handles = { Diego = "zzamboni",
                Chris = "cmsj",
                Aaron = "asmagill" } -- associative array
#+end_src

Indices are indicated using square brackets. Numeric indices start at 1 (not 0 as in most other languages). For identifier-like string indices, you can use the dot shortcut. Requesting a non-existent index returns =nil=:

#+begin_src lua
  > unicorns[1]
  nil
  > people[0]
  nil
  > people[1]
  Chris
  > handles['Diego']
  zzamboni
  > handles.Diego
  zzamboni
  > handles.Michael
  nil
#+end_src

Within the curly-brace notation, indices that are not identifier-like (letters, numbers, underscores) need to be enclosed in quotes and square brackets. Values can be tables as well:

#+begin_src lua
  colors = { ["U.S."] = { "red", "white", "blue" },
             Mexico = { "green", "white", "red" },
             Germany = { "black", "red", "yellow" } }
#+end_src

With non-identifier indices, you cannot use the dot-notation. Also, to see a table within the Hammerspoon console, use {{{hsapi(hs.inspect)}}}:

#+begin_src lua
  > colors["U.S."]
  table: 0x618000470400
  > hs.inspect(colors.Mexico)
  { "green", "white", "red" }
  > hs.inspect(colors)
  {
    Germany = { "black", "red", "yellow" },
    Mexico = { "green", "white", "red" },
    ["U.S."] = { "red", "white", "blue" }
  }
#+end_src

Iteration through an array is commonly done using the {{{luafun(ipairs)}}} functions. Note that it will only iterate through contiguous numeric indices starting at 1, so that it does not work well with "sparse" tables.

#+begin_src lua
  > for i,v in ipairs(people) do print(i, v) end
  1   Chris
  2   Aaron
  3   Diego
  > people[4]='John'
  > for i,v in ipairs(people) do print(i, v) end
  1   Chris
  2   Aaron
  3   Diego
  4   John
  > people[7]='Mike'
  > for i,v in ipairs(people) do print(i, v) end
  1   Chris
  2   Aaron
  3   Diego
  4   John
  > hs.inspect(people)
  { "Chris", "Aaron", "Diego", "John",
    [7] = "Mike"
  }
#+end_src

The {{{luafun(pairs)}}} function, on the other hand, will iterate through all the elements in the table (both numeric and string indices), but does not guarantee their order. Both numeric and string indices can be mixed in a single table (although this gets confusing quickly unless you access everything using {{{luafun(pairs)}}}).

#+begin_src lua
  > for i,v in pairs(people) do print(i,v) end
  1   Chris
  2   Aaron
  3   Diego
  4   John
  7   Mike
  > for i,v in ipairs(handles) do print(i,v) end
  <no output>
  > for i,v in pairs(handles) do print(i,v) end
  Aaron   asmagill
  Diego   zzamboni
  Chris   cmsj
  > handles[1]='whoa'  -- assign the first numeric index
  > hs.inspect(handles)
  { "whoa",
    Aaron = "asmagill",
    Chris = "cmsj",
    Diego = "zzamboni"
  }
  > for i,v in ipairs(handles) do print(i,v) end
  1   whoa
#+end_src

The built-in {{{luadoc(table,6.6)}}} module includes a number of useful table-manipulation functions, including the following:

- {{{luafun(table.concat)}}} for joining the values of a list in a single string (equivalent to =join= in other languages). This only joins the elements that would be returned by {{{luafun(ipairs)}}}.

  #+begin_src lua
    > table.concat(people, ", ")
    Chris, Aaron, Diego, John
  #+end_src

- {{{luafun(table.insert)}}} adds an element to a list, by default adding it to the end.

  #+begin_src lua
    > hs.inspect(people)
    { "Chris", "Aaron", "Diego", "John", "Bill",
      [7] = "Mike"
    }
    > table.insert(people, "George")
    > hs.inspect(people)
    { "Chris", "Aaron", "Diego", "John", "Bill", "George", "Mike" }
  #+end_src

  Note how in the last example, the contiguous indices have finally caught up to 7, so the last element is no longer shown separately (and will now be included by {{{luafun(ipairs)}}}, {{{luafun(table.concat)}}}, etc.

- {{{luafun(table.remove)}}} removes an element from a list, by default the last one. It returns the removed element.

  #+begin_src lua
    > for i=1,4 do print(table.remove(people)) end
    Mike
    George
    Bill
    John
    > hs.inspect(people)
    { "Chris", "Aaron", "Diego" }
  #+end_src

Notable omissions from the language and the {{{luadoc(table,6.6)}}} module are "get keys" and "get values" functions, common in other languages. This may be explained by the flexible nature of Lua tables, so that those functions would need to behave differently depending on the contents of the table. If you need them, you can easily build your own. For example, if you want to get a sorted list of the keys in a table, you can use this function:

#+begin_src lua
  function sortedkeys(tab)
    local keys={}
    for k,v in pairs(tab) do table.insert(keys, k) end
    table.sort(keys)
    return keys
  end
#+end_src

