content-org/zzamboni.org
**** Tables as namespaces
:PROPERTIES:
:CUSTOM_ID: tables-as-namespaces
:END:

Functions in Lua are first-class objects, which means they can be used like any other value. This means that functions can be stored in tables, and this is how namespaces (or "modules") are implemented in Lua. We can inspect an manipulate them like any other table. Let us look at the {{{luadoc(table,6.6)}}} library itself. First, the module itself is a table:

#+begin_src lua
  > table
  table: 0x61800046f740
#+end_src

Second, we can inspect its contents using the functions we know:

#+begin_src lua
  > hs.inspect(table)
  {
    concat = <function 1>,
    insert = <function 2>,
    move = <function 3>,
    pack = <function 4>,
    remove = <function 5>,
    sort = <function 6>,
    sortedkeys = <function 7>,
    unpack = <function 8>
  }
#+end_src

The function values themselves are opaque (we cannot see their code), but we can easily extend the module. For example, we could add our =sortedkeys()= function above to the =table= module for consistency. Lua allows us to specify the namespace of a function in its declaration:

#+begin_src lua
  function table.sortedkeys(tab)
    local keys={}
    for k,v in pairs(tab) do table.insert(keys, k) end
    table.sort(keys)
    return keys
  end
#+end_src

All the Hammerspoon modules are implemented the same way:

#+begin_src lua
  > type(hs)
  table
  > type(hs.mouse)
  table
  > hs.inspect(hs.mouse)
  {
    get = <function 1>,
    getAbsolutePosition = <function 2>,
    getButtons = <function 3>,
    getCurrentScreen = <function 4>,
    getRelativePosition = <function 5>,
    set = <function 6>,
    setAbsolutePosition = <function 7>,
    setRelativePosition = <function 8>,
    trackingSpeed = <function 9>
  }
#+end_src

The common way of defining a new module in Lua is to create an empty table, and populate it with functions or variables as needed. For example, let's put our [[file:/post/just-enough-lua-to-be-productive-in-hammerspoon-part-1/#functions][double-click generator]] in a module. Create the file =~/.hammerspoon/doubleclick.lua= with the following contents:

#+begin_src lua
  local mod={}

  mod.default_modifiers={}

  function mod.leftDoubleClick(modifiers)
    modifiers = modifiers or mod.default_modifiers
    local pos=hs.mouse.getAbsolutePosition()
    hs.eventtap.event.newMouseEvent(
      hs.eventtap.event.types.leftMouseDown, pos, modifiers)
      :setProperty(hs.eventtap.event.properties.mouseEventClickState, 2)
      :post()
    hs.eventtap.event.newMouseEvent(
      hs.eventtap.event.types.leftMouseUp, pos, modifiers):post()
  end

  function mod.bindto(keyspec)
    hs.hotkey.bindSpec(keyspec, mod.leftDoubleClick)
  end

  return mod
#+end_src

You can then, from the console, do the following:

#+begin_src lua
  > doubleclick=require('doubleclick')
  > doubleclick.bindto({ {"ctrl", "alt", "cmd"}, "p" })
  19:53:53     hotkey: Disabled previous hotkey ⌘⌃⌥P
               hotkey: Enabled hotkey ⌘⌃⌥P
#+end_src

You have written and loaded your first Lua module. Let's try it out!  Press {{{keys(Ctrl ⌘ Alt p)}}} while your cursor is over a word in your terminal or web browser, to select it as if you had double-clicked it. You can also change the modifiers used with it. For example, did you know that Cmd-double-click can be used to open URLs from the macOS Terminal application?

#+begin_src lua
  > doubleclick.default_modifiers={cmd=true}
#+end_src

Now try pressing {{{keys(Ctrl ⌘ Alt p)}}} while your pointer is over a URL displayed on your Terminal (you can just type one yourself to test), and it will open in your browser.

Note that the name =doubleclick= does not have any special meaning---it is a regular variable to which you assigned the value returned by =require('doubleclick')=, which is the value of the =mod= variable created within the module file (note that within the module file you use the local variable name to refer to functions and variables within itself). You could assign it to any name you want:

#+begin_src lua
  > a=require('doubleclick')
  > a.leftDoubleClick()
#+end_src

The argument of the {{{luafun(require)}}} function is the name of the file to load, without the =.lua= extension. Hammerspoon by default adds your =~/.hammerspoon/= directory to its load path, along with any other default directories in your system. You can view the places where Hammerspoon will look for files by examining the =package.path= variable. On my machine I get the following:

#+begin_example
  > package.path
  /Users/zzamboni/.hammerspoon/?.lua;/Users/zzamboni/.hammerspoon/?/
  init.lua;/Users/zzamboni/.hammerspoon/Spoons/?.spoon/init.lua;/usr/
  local/share/lua/5.3/?.lua;/usr/local/share/lua/5.3/?/init.lua;/usr/
  local/lib/lua/5.3/?.lua;/usr/local/lib/lua/5.3/?/init.lua;./?.lua;
  ./?/init.lua;/Users/zzamboni/Dropbox/Personal/devel/hammerspoon/
  hammerspoon/build/Hammerspoon.app/Contents/Resources/extensions/?.lua;
  /Users/zzamboni/Dropbox/Personal/devel/hammerspoon/hammerspoon/build/
  Hammerspoon.app/Contents/Resources/extensions/?/init.lua
#+end_example

{{% tip %}}

Hammerspoon automatically loads any modules under the =hs= namespace the first time you use them. For example, when you use {{{hsapi(hs.application)}}} for the first time, you will see a message in the console:

#+begin_src lua
  > hs.application.get("Terminal")
  2017-10-31 06:47:15: -- Loading extension: application
  hs.application: Terminal (0x61000044dfd8)
#+end_src

If you want to avoid these messages, you need to explicitly load the modules and assign them to variables, as follows:

#+begin_src lua
  > app=require('hs.application')
  > app.get("Terminal")
  hs.application: Terminal (0x610000e49118)
#+end_src

This avoids the console message and has the additional benefit of allowing you to use =app= (you can use whatever variable you want) instead of typing =hs.application= in your code. This is a matter of taste---I usually prefer to have the full descriptive names (makes the code easier to read), but when dealing with some of the longer module names (e.g. {{{hsapi(hs.distributednotifications)}}}), this technique can be useful.

{{% /tip %}}

