content/post/2017-10-21-just-enough-lua-to-be-productive-in-hammerspoon-part2/index.md


## Tables as namespaces {#tables-as-namespaces}

Functions in Lua are first-class objects, which means they can be used like any other value. This means that functions can be stored in tables, and this is how namespaces (or "modules") are implemented in Lua. We can inspect an manipulate them like any other table. Let us look at the [table](https://www.lua.org/manual/5.3/manual.html#6.6) library itself. First, the module itself is a table:

```lua
> table
table: 0x61800046f740
```

Second, we can inspect its contents using the functions we know:

```lua
> hs.inspect(table)
{
  concat = <function 1>,
  insert = <function 2>,
  move = <function 3>,
  pack = <function 4>,
  remove = <function 5>,
  sort = <function 6>,
  sortedkeys = <function 7>,
  unpack = <function 8>
}
```

The function values themselves are opaque (we cannot see their code), but we can easily extend the module. For example, we could add our `sortedkeys()` function above to the `table` module for consistency. Lua allows us to specify the namespace of a function in its declaration:

```lua
function table.sortedkeys(tab)
  local keys={}
  for k,v in pairs(tab) do table.insert(keys, k) end
  table.sort(keys)
  return keys
end
```

All the Hammerspoon modules are implemented the same way:

```lua
> type(hs)
table
> type(hs.mouse)
table
> hs.inspect(hs.mouse)
{
  get = <function 1>,
  getAbsolutePosition = <function 2>,
  getButtons = <function 3>,
  getCurrentScreen = <function 4>,
  getRelativePosition = <function 5>,
  set = <function 6>,
  setAbsolutePosition = <function 7>,
  setRelativePosition = <function 8>,
  trackingSpeed = <function 9>
}
```

The common way of defining a new module in Lua is to create an empty table, and populate it with functions or variables as needed. For example, let's put our [double-click generator](/post/just-enough-lua-to-be-productive-in-hammerspoon-part-1/#functions) in a module. Create the file `~/.hammerspoon/doubleclick.lua` with the following contents:

```lua
local mod={}

mod.default_modifiers={}

function mod.leftDoubleClick(modifiers)
  modifiers = modifiers or mod.default_modifiers
  local pos=hs.mouse.getAbsolutePosition()
  hs.eventtap.event.newMouseEvent(
    hs.eventtap.event.types.leftMouseDown, pos, modifiers)
    :setProperty(hs.eventtap.event.properties.mouseEventClickState, 2)
    :post()
  hs.eventtap.event.newMouseEvent(
    hs.eventtap.event.types.leftMouseUp, pos, modifiers):post()
end

function mod.bindto(keyspec)
  hs.hotkey.bindSpec(keyspec, mod.leftDoubleClick)
end

return mod
```

You can then, from the console, do the following:

```lua
> doubleclick=require('doubleclick')
> doubleclick.bindto({ {"ctrl", "alt", "cmd"}, "p" })
19:53:53     hotkey: Disabled previous hotkey ⌘⌃⌥P
             hotkey: Enabled hotkey ⌘⌃⌥P
```

You have written and loaded your first Lua module. Let's try it out!  Press <kbd>Ctrl​-​⌘​-​Alt​-​p</kbd> while your cursor is over a word in your terminal or web browser, to select it as if you had double-clicked it. You can also change the modifiers used with it. For example, did you know that Cmd-double-click can be used to open URLs from the macOS Terminal application?

```lua
> doubleclick.default_modifiers={cmd=true}
```

Now try pressing <kbd>Ctrl​-​⌘​-​Alt​-​p</kbd> while your pointer is over a URL displayed on your Terminal (you can just type one yourself to test), and it will open in your browser.

Note that the name `doubleclick` does not have any special meaning---it is a regular variable to which you assigned the value returned by `require('doubleclick')`, which is the value of the `mod` variable created within the module file (note that within the module file you use the local variable name to refer to functions and variables within itself). You could assign it to any name you want:

```lua
> a=require('doubleclick')
> a.leftDoubleClick()
```

The argument of the [`require()`](https://www.lua.org/manual/5.3/manual.html#pdf-require) function is the name of the file to load, without the `.lua` extension. Hammerspoon by default adds your `~/.hammerspoon/` directory to its load path, along with any other default directories in your system. You can view the places where Hammerspoon will look for files by examining the `package.path` variable. On my machine I get the following:

```text
> package.path
/Users/zzamboni/.hammerspoon/?.lua;/Users/zzamboni/.hammerspoon/?/
init.lua;/Users/zzamboni/.hammerspoon/Spoons/?.spoon/init.lua;/usr/
local/share/lua/5.3/?.lua;/usr/local/share/lua/5.3/?/init.lua;/usr/
local/lib/lua/5.3/?.lua;/usr/local/lib/lua/5.3/?/init.lua;./?.lua;
./?/init.lua;/Users/zzamboni/Dropbox/Personal/devel/hammerspoon/
hammerspoon/build/Hammerspoon.app/Contents/Resources/extensions/?.lua;
/Users/zzamboni/Dropbox/Personal/devel/hammerspoon/hammerspoon/build/
Hammerspoon.app/Contents/Resources/extensions/?/init.lua
```

{{% tip %}}

Hammerspoon automatically loads any modules under the `hs` namespace the first time you use them. For example, when you use [`hs.application`](https://www.hammerspoon.org/docs/hs.application) for the first time, you will see a message in the console:

```lua
> hs.application.get("Terminal")
2017-10-31 06:47:15: -- Loading extension: application
hs.application: Terminal (0x61000044dfd8)
```

If you want to avoid these messages, you need to explicitly load the modules and assign them to variables, as follows:

```lua
> app=require('hs.application')
> app.get("Terminal")
hs.application: Terminal (0x610000e49118)
```

This avoids the console message and has the additional benefit of allowing you to use `app` (you can use whatever variable you want) instead of typing `hs.application` in your code. This is a matter of taste---I usually prefer to have the full descriptive names (makes the code easier to read), but when dealing with some of the longer module names (e.g. [`hs.distributednotifications`](https://www.hammerspoon.org/docs/hs.distributednotifications)), this technique can be useful.

{{% /tip %}}
