content/post/2017-10-21-just-enough-lua-to-be-productive-in-hammerspoon-part2/index.md


## Patterns {#patterns}

If you are familiar with regular expressions, you know how powerful they are for examining and manipulating strings in any programming language.  Lua has [patterns](https://www.lua.org/manual/5.3/manual.html#6.4.1), which fulfill many of the same functions but have a different syntax and some limitations. They are used by many functions in the string library like [`string.find()`](https://www.lua.org/manual/5.3/manual.html#pdf-string.find) and [`string.match()`](https://www.lua.org/manual/5.3/manual.html#pdf-string.match).

The following are some differences and similarities you need to be aware of when using patterns:

-   The dot (`.`) represents any character, just like in regexes.

-   The asterisk (`*`), plus sign (`+`) and question mark (`?`) represent "zero or more", "one or more" and "one or none" of the previous character, just like in regexes. Unlike regexes, these characters can only be applied to a single character and not to a whole capture group (i.e. the regex `(foo)+` is not possible).

-   Alternations, represented by the vertical bar (`|`) in regexes, are not supported.

-   The caret (`^`) and dollar sign (`$`) represent "beginning of string" and "end of string", just like in regexes.

-   The dash (`-`) represents a non-greedy "zero or more" (i.e. match the shortest possible string instead of the longest one) of the previous character, unlike in regexes, in which it's commonly indicate by a question mark following the corresponding `*` or `+` The regex `.*?` is equivalent to the Lua pattern `.-`.

-   The escape character is the ampersand (`%`) instead of the backslash (`\`).

-   Most character classes are represented by the same characters, but preceded by ampersand. For example `%d` for digits, `%s` for spaces, `%w` for alphanumeric characters.

For most common use cases, Lua patterns are enough, you just have to be aware of their differences. If you encounter something that really cannot be done, you can always resort to libraries like [Lrexlib](http://rrthomas.github.io/lrexlib/), which provide interfaces to real regex libraries. Unfortunately these are not included in Lua, so you would need to install them on your own.

Patterns, just like regular expressions, are commonly used for string manipulation, using primarily functions from the [string](https://www.lua.org/manual/5.3/manual.html#6.4) library.
