content/post/2017-10-21-just-enough-lua-to-be-productive-in-hammerspoon-part2/index.md


## String manipulation {#string-manipulation}

Lua includes the [string](https://www.lua.org/manual/5.3/manual.html#6.4) library to implement common string manipulation functions, including pattern matching. All of these functions can be called either as regular functions, with the string as the first argument, or as method calls on the string itself, using the colon syntax (which, as we saw [before](/post/just-enough-lua-to-be-productive-in-hammerspoon-part-1/#dot-vs-colon-method-access-in-lua), gets converted to the same call). For example, the following two are equivalent:

```lua
string.find(a, "^foo")
a:find("^foo")
```

You can find the full documentation in the [Lua reference manual](https://www.lua.org/manual/5.3/manual.html#6.4) and many other examples in the [Lua-users wiki String Library Tutorial](http://lua-users.org/wiki/StringLibraryTutorial). The following is a partial list of some of the functions I have found most useful:

-   [`string.find(str, pat, pos, plain)`](https://www.lua.org/manual/5.3/manual.html#pdf-string.find) finds the pattern within the string. By default the search starts at the beginning of the string, but can be modified with the `pos` argument (index starts at 1, as with the tables). By default `pat` is intepreted as a Lua pattern, but this can be disabled by passing `plain` as a true value. If the pattern is not found, returns `nil`.  If the pattern is found, the function returns the start and end position of the pattern within the string. Furthermore, if the pattern contains parenthesis capture groups, all groups are returned as well.  For example:

    ```lua
    > string.find("bah", "ah")
    2   3
    > string.find("bah", "foo")
    nil
    > string.find("bah", "(ah)")
    2   3   ah
    > p1, p2, g1, g2 = string.find("bah", "(b)(ah)")
    > p1,p2,g1,g2
    1   3   b   ah
    ```

    Note that the return value is not a table, but rather multiple values, as shown in the last example.

    {{% tip %}}

It can sometimes be convenient to handle multiple values as a table or as separate entities, depending on the circumstances. For example, you may have a programmatically-constructed pattern with a variable number of capture groups, so you cannot know to how many variables you need to assign the result. In this case, the [`table.pack()`](https://www.lua.org/manual/5.3/manual.html#pdf-table.pack) and [`table.unpack()`](https://www.lua.org/manual/5.3/manual.html#pdf-table.unpack) functions can be useful.

[`table.pack()`](https://www.lua.org/manual/5.3/manual.html#pdf-table.pack) takes a variable number of arguments and returns them in a table which contains an array component containing the values, plus an index `n` containing the total number of elements:

```lua
> res = table.pack(string.find("bah", "(b)(ah)"))
> res
table: 0x608000c76e80
> hs.inspect(res)
{ 1, 3, "b", "ah",
  n = 4
}
```

[`table.unpack()`](https://www.lua.org/manual/5.3/manual.html#pdf-table.unpack) does the opposite, expanding an array into separate values which can be assigned to separate values as needed, or passed as arguments to a function:

```lua
> args={"bah", "(b)(ah)"}
> string.find(args)
[string "return string.find(args)"]:1:
  bad argument #1 to 'find' (string expected, got table)
> string.find(table.unpack(args))
1   3   b   ah
```

{{% /tip %}}

-   [`string.match(str, pat, pos)`](https://www.lua.org/manual/5.3/manual.html#pdf-string.match) is similar to `string.find`, but it does not return the positions, rather it returns the part of the string matched by the pattern, or if the pattern contains capture groups, returns the captured segments:

    ```lua
    > string.match("bah", "ah")
    ah
    > string.match("bah", "foo")
    nil
    > string.match("bah", "(b)(ah)")
    b   ah
    ```

-   [`string.gmatch(str, pat)`](https://www.lua.org/manual/5.3/manual.html#pdf-string.gmatch) returns a function that returns the next match of `pat` within `str` every time it is called, returning `nil` when there are no more matches. If `pat` contains capture groups, they are returned on each iteration.

    ```lua
    > a="Hammerspoon is awesome!"
    > f=string.gmatch(a, "(%w+)")
    > f()
    Hammerspoon
    > f()
    is
    > f()
    awesome
    > f()
    ```

    Most commonly, this is used inside a loop:

    ```lua
    > for cap in string.gmatch(a, "%w+") do print(cap) end
    Hammerspoon
    is
    awesome
    ```

-   [`string.format(formatstring, …​)`](https://www.lua.org/manual/5.3/manual.html#pdf-string.format) formats a sequence of values according to the given format string, following the same formatting rules as the ISO C `sprintf()` function.  It additionally supports a new format character `%q`, which formats a string value in a way that can be read back by Lua, escaping or quoting characters as needed (for example quotes, newlines, etc.).

-   [`string.len(str)`](https://www.lua.org/manual/5.3/manual.html#pdf-string.len) returns the length of the string.

-   [`string.lower(str)`](https://www.lua.org/manual/5.3/manual.html#pdf-string.lower) and [`string.upper(str)`](https://www.lua.org/manual/5.3/manual.html#pdf-string.upper) convert the string to lower and uppercase, respectively.

-   [`string.gsub(str, pat, rep, n)`](https://www.lua.org/manual/5.3/manual.html#pdf-string.gsub) is a very powerful string-replacement function which hides considerably more power than its simple syntax would lead you to believe. In general, it replaces all (or the first `n`) occurrences of `pat` in `str` with the replacement `rep`. However, `rep` can take any of the following values:

    -   A string which is used for the replacement. If the string contains _%m_, where _m_ is a number, the it is replaced by the m-th captured group (or the whole match if _m_ is zero).

    -   A table which is consulted for the replacement values, using the first capture group as a key (or the whole match if there are no captures). For example:

        ```lua
        > a="Event type codes: leftMouseDown=$leftMouseDown, rightMouseDown=$rightMouseDown, mouseMoved=$mouseMoved"
        > a:gsub("%$(%w+)", hs.eventtap.event.types)
        Event type codes: leftMouseDown=1, rightMouseDown=3, mouseMoved=5   3
        ```

    -   A function which is executed with the captured groups (or the whole match) as an argument, and whose return value is used as the replacement. For example, using the `os.getenv` function, we can easily replace environment variables by their values in a string:

        ```lua
        > a="Hello $USER, your home directory is $HOME"
        > a:gsub("%$(%w+)", os.getenv)
        Hello zzamboni, your home directory is /Users/zzamboni  2
        ```

    Note that `gsub` returns the modified string as its first return value, and the number of replacements it made as the second (`2` in the example above). If you don't need the number, you can simply ignore it (you don't even need to assign it). Also note that `gsub` does not modify the original string, only returns a copy with the changes:

    ```lua
    > b = a:gsub("%$(%w+)", os.getenv)
    > b
    Hello zzamboni, your home directory is /Users/zzamboni
    > a
    Hello $USER, your home directory is $HOME
    ```


## Keep learning! {#keep-learning}

You know now enough Lua to start being productive with Hammerspoon.  You'll pick up more details as you play with it. If you need more information, I can recommend the following resources, which I have found useful:

-   [The Lua 5.3 Reference Manual](http://www.lua.org/manual/5.3/), available at the official [Lua website](http://www.lua.org).

-   [The Lua Wiki](http://lua-users.org/wiki/), a community-maintained wiki with many descriptions, tips, examples and tutorials.

Have fun!
